In [1]:
import pandas as pd

In [3]:
file = "ted_talks.csv"
ted_df = pd.read_csv(file)

In [16]:
ted_sorted_df = ted_df.sort_values("views",ascending=False)

In [17]:
ted_sorted_df.head(1)

,comments,description,duration,event,languages,main_speaker,name,title,views
0,4553,Sir Ken Robinson makes an entertaining and pro...,1164,TED2006,60,Ken Robinson,Ken Robinson: Do schools kill creativity?,Do schools kill creativity?,47227110

In [18]:
ted_sorted_df.tail(1)

,comments,description,duration,event,languages,main_speaker,name,title,views
594,20,"In the midst of an earlier crisis, Haitian aut...",3573,University of California,0,Edwidge Danticat,Edwidge Danticat: Stories of Haiti,Stories of Haiti,50443

In [19]:
bin = [0,10000,50000,100000,500000,1000000,5000000,10000000,50000000]
name = ["<10000","10000-50000","50000-100000","100000-500000","500000-1000000","1000000-5000000","5000000-10000000","10000000-50000000"]

In [23]:
ted_sorted_df["view category"] = pd.cut(ted_sorted_df["views"],bin,labels=name)

In [26]:
ted_group = ted_sorted_df.groupby("view category")

In [28]:
ted_group[['comments','languages','duration']].mean()

                     comments  languages     duration
view category
<10000                    NaN        NaN          NaN
10000-50000               NaN        NaN          NaN
50000-100000        35.333333   0.000000  1591.666667
100000-500000       90.336957  18.967391   825.018116
500000-1000000     118.005208  24.733073   830.218750
1000000-5000000    219.678063  29.534900   819.066239
5000000-10000000   469.153846  38.569231   842.969231
10000000-50000000  996.882353  43.470588   963.264706